benchmark_results_replicated/20260803_085536/analysis/rep19/run/go_heavy_c100/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since-heavy
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.41ms   12.05ms 141.94ms   76.07%
    Req/Sec     1.28k    72.68     1.55k    71.79%
  Latency Distribution
     50%   17.67ms
     75%   25.80ms
     90%   35.90ms
     99%   61.55ms
  306434 requests in 1.00m, 42.32MB read
Requests/sec:   5103.03
Transfer/sec:    721.70KB
P95: 43693
P99: 61554